<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent download recipe to download the latest unlicensed Microsoft Word 2016 installer package for Office 365 and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.jherrinjr.jamf.microsoftword365</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Campus Standard</string>
		<key>GROUP_NAME</key>
		<string>AllDevices</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-AllDevices.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install</string>
		<key>NAME</key>
		<string>Microsoft Word</string>
		<key>POLICY_CATEGORY</key>
		<string>Campus Standard</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" &amp;&amp; echo "Corrected permissions for %NAME%."</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Reinstall</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft Word is a popular and powerful word processing app.</string>
        <key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MicrosoftWord365.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.microsoftword365</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
