<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Firefox, creats a pkg and uploads it to the connected JAMF repository.
</string>
	<key>Identifier</key>
	<string>com.github.cgraysonjr.jamf.Mozilla-Firefox</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mozilla Firefox</string>
		<key>CATEGORY</key>
		<string>Browser</string>
		<key>GROUP_NAME</key>
		<string>"update-smart-%NAME%"</string>
		<key>GROUP_TEMPLATE</key>
		<string>../Templates/SmartGroup-update-smart-regex.xml</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>POLICY_CATEGORY</key>
		<string>AutoPKG</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>../Templates/Policy-install-latest-featured.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Reinstall</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Mozilla Firefox is a free and open source web browser.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Firefox_EN</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
