Identifier: com.github.autopkg.download.MSTeams2019
MinimumVersion: '2.3'

ParentRecipe: com.github.autopkg.download.MSOfficeMacProduct
ParentRecipeTrustInfo:
  non_core_processors:
    MSOfficeMacURLandUpdateInfoProvider:
      git_hash: 0667df6e1f836b293d216ffe19b02f3353267292
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSOfficeMacURLandUpdateInfoProvider.py
      sha256_hash: 59f8425bc4287d9dd33a9a0d13291fd482223b1691679a283c081aabc367e913
  parent_recipes:
    com.github.autopkg.download.MSOfficeMacProduct:
      git_hash: 55e47128864841e568cf20ccd2b852fea48faa50
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSOfficeMacProduct.download.recipe
      sha256_hash: 9d98baa020cb9228ff75122bdd7b92a20196cedb9f5983c140e7c1e771cf26cf

Input:
    CHANNEL: Production
    LOCALE_ID: '1033'
    NAME: MSTeams2019
    PRODUCT: Teams
    VERSION: latest
    CATEGORY: Productivity
    GROUP_NAME: "%NAME%-update-smart"
    GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
    TESTING_GROUP_NAME: AutoPKG
    POLICY_CATEGORY: AutoPKG
    POLICY_TEMPLATE: Policy-install-latest.xml
    POLICY_NAME: "Install Latest %NAME%"
    SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
    SELF_SERVICE_DESCRIPTION:
    SELF_SERVICE_ICON: "%NAME%.png"
    INSTALL_BUTTON_TEXT: "Install %version%"
    REINSTALL_BUTTON_TEXT: "Install %version%"
    UPDATE_PREDICATE: "pkg_uploaded == False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"