Identifier: com.github.cgraysonjr.jamf.zoom
MinimumVersion: '2.3'

Input:
    NAME: Zoom
    NAME_DETAIL: "%NAME%"
    BUNDLE_ID: us.zoom.xos
    DOWNLOAD_URL: https://zoom.us/client/latest/ZoomInstallerIT.pkg
    CATEGORY: Audio and Visual
    GROUP_NAME: "update-smart-%NAME_DETAIL%"
    GROUP_TEMPLATE: "%RECIPE_DIR%/Templates/SmartGroup-update-smart-regex.xml"
    TESTING_GROUP_NAME: Testing
    POLICY_CATEGORY: AutoPKG
    POLICY_TEMPLATE: "%RECIPE_DIR%/Templates/Policy-install-latest.xml"
    POLICY_NAME: "Install Latest %NAME_DETAIL%"
    POLICY_RUN_COMMAND: chown -R &quot;$(stat -f%Su /dev/console):staff&quot; &quot;/Applications/%NAME_DETAIL%.app&quot; &amp;&amp; echo &quot;Corrected permissions for %NAME_DETAIL%.&quot;
    SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
    SELF_SERVICE_DESCRIPTION: The Zoom app provides cloud-hosted video conferencing, plus online meetings and group messaging.
    SELF_SERVICE_ICON: "%RECIPE_DIR%/logos/%NAME_DETAIL%.png"
    INSTALL_BUTTON_TEXT: "Install %version%"
    REINSTALL_BUTTON_TEXT: "Install %version%"
    UPDATE_PREDICATE: "pkg_uploaded == True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"