<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive Universal, creates a pkg and uploads it to the connected JAMF repository. Creates a policy and assigns it to the All MAnaged Clients Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.cgraysonjr.jamf.Google-Drive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Google Drive</string>
		<key>NAME_DETAIL</key>
		<string>GoogleDrive</string>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>GROUP_NAME</key>
		<string>All Managed Clients</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/Templates/SmartGroup-AllManagedClients</string>
		<key>POLICY_CATEGORY</key>
		<string>Utilities</string>
		<key>POLICY_NAME</key>
		<string>AUTOPKG-%NAME_DETAIL%</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>chown -R &quot;$(stat -f%Su /dev/console):staff&quot; &quot;/Applications/%NAME%.app&quot; &amp;&amp; echo &quot;Corrected permissions for %NAME%.&quot;</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/Templates/Policy-install-latest-featured.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Reinstall %version%</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Get access to your work files anywhere through secure cloud storage and with Google Drive.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/logos/%NAME_DETAIL%.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.googledrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
