Identifier: com.github.cgraysonjr.jamf.MSOffice-2019-PP
Input:
  CATEGORY: Microsoft
  CHANNEL: Production
  GROUP_NAME: update-smart-%NAME_DETAIL%
  GROUP_TEMPLATE: '%RECIPE_DIR%/Templates/SmartGroup-update-smart-regex.xml'
  INSTALL_BUTTON_TEXT: Install %VERSION%
  LOCALE_ID: '1033'
  NAME: Microsoft PowerPoint
  NAME_DETAIL: MSOffice2019PP
  POLICY_CATEGORY: AutoPKG
  POLICY_NAME: Install Latest %NAME_DETAIL%
  POLICY_RUN_COMMAND: chown -R &quot;$(stat -f%Su /dev/console):staff&quot; &quot;/Applications/%NAME%.app&quot;
    &amp;&amp; echo &quot;Corrected permissions for %NAME%.&quot;
  POLICY_TEMPLATE: '%RECIPE_DIR%/Templates/Policy-install-latest.xml'
  PRODUCT: PowerPoint2019
  REINSTALL_BUTTON_TEXT: Install %VERSION%
  SELF_SERVICE_DESCRIPTION: Microsoft PowerPoint allows the creation and presentation
    of professional slide decks.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: '%RECIPE_DIR%/logos/%NAME_DETAIL%.png'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == True
  VERSION: latest
MinimumVersion: '2.3'
ParentRecipe: com.github.autopkg.download.MSOfficeMacProduct
ParentRecipeTrustInfo:
  non_core_processors:
    MSOfficeMacURLandUpdateInfoProvider:
      git_hash: 642b719956d4e4e8d464ec396ea21b8127ad9855
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSOfficeMacURLandUpdateInfoProvider.py
      sha256_hash: 3920f8fb720b7cd91f42e53c5b32bf8cff269633c7aad0e224d545ba5cc50ff1
  parent_recipes:
    com.github.autopkg.download.MSOfficeMacProduct:
      git_hash: 55e47128864841e568cf20ccd2b852fea48faa50
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/MSOfficeUpdates/MSOfficeMacProduct.download.recipe
      sha256_hash: 9d98baa020cb9228ff75122bdd7b92a20196cedb9f5983c140e7c1e771cf26cf
Process:
- Arguments:
    category_name: '%CATEGORY%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
- Arguments:
    predicate: '%UPDATE_PREDICATE%'
  Processor: StopProcessingIf
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator
- Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
- Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
